docs/critical_thinking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-25 Sat 15:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Critical Thinking</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Critical Thinking</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge6c1071">1. Introduction</a></li>
<li><a href="#org33d1f13">2. Meta-cognitive Terms</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge6c1071" class="outline-2">
<h2 id="orge6c1071"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Critical thinking is reasonable and reflective thinking focused on
deciding what to believe or do.
</p>

<p>
Ideal critical thinkers are disposed to:
</p>

<ol class="org-ol">
<li>Care that their beliefs be true, and their decisions be justified
<ol class="org-ol">
<li>Seek alternate hypotheses and explanations</li>
<li>Consider seriously other points of view</li>
<li>Try to be well informed</li>
</ol></li>
<li>Care to understand and present a position honestly and clearly.
<ol class="org-ol">
<li>Discover and listen to others' view and reasons</li>
<li>Be clear about the intended meaning of what is said</li>
<li>Determine and focus on the conclusion or question</li>
<li>Seek and offer reasons</li>
<li>Take into account the total situation</li>
<li>Be reflectively aware of basic beliefs</li>
</ol></li>
<li>Care about every person
<ol class="org-ol">
<li>Avoid intimidating or confusing others, account for others'
feelings and level of understanding</li>
</ol></li>
</ol>

<p>
Critical thinkers are able to do the following:
</p>

<ol class="org-ol">
<li>Focus on a question</li>
<li>Analyze arguments</li>
<li>Ask and answer clarification or challenge questions</li>
<li>Judge the credibility of a source</li>
<li>Observe and judge observation reports</li>
<li>Deduce and judge deduction</li>
<li>Make material inferences
<ol class="org-ol">
<li>To generalizations, and explanatory hypotheses</li>
</ol></li>
<li>Make and judge value judgments</li>
<li>Define terms and judge definitions, using appropriate criteria</li>
<li>Attribute unstated assumptions that belong under both basic
clarification and inference</li>
<li>Consider and reason from premises</li>
<li>Integrate the dispositions in making and defending a decision</li>
<li>Be sensitive to feelings, level of knowledge and degree of
sophistication of others</li>
<li>Employ appropriate rhetorical strategies, reacting to fallacy
labels in an appropriate manner.</li>
</ol>
</div>
</div>
